EDIT-Aeterna/tuya-zigbee-lock-local/firmware/efr32_app.c
/* efr32_app.c -- TYZS3 (EFR32MG13P732) on-chip HAL + EmberZNet glue for the
 * Kagel lock firmware. Hardware layer under the portable, host-tested cores:
 *   lock_app -> nicki_ek_lock_serial
 *
 * Integrated against Gecko SDK 4.5 (emlib + NVM3 + EmberZNet AF). Exposes
 * kagel_app_init()/kagel_app_tick() (called from main.c) and app_zb_fc00_rx()
 * (called from app.c's emberAfPreCommandReceivedCallback).
 *
 *   Cluster 0xEF00 : lock DP telemetry (Nicki_EK framing) -> ty0a01_lock_kagel.js
 *   Cluster 0xFC00 : vendor control channel (REMOTE_DP / CREATE_TEMP_PW)
 */
#include "app/framework/include/af.h"
#include "app/framework/plugin/network-steering/network-steering.h"
#include "nvm3_default.h"
#include "em_cmu.h"
#include "em_gpio.h"
#include "em_usart.h"
#include "sl_sleeptimer.h"
#include "sl_power_manager.h"
#include "lock_app.h"
#include <string.h>

/* ---- Sleepy-end-device polling (leaf stack) -------------------------------
 * A SED's radio is OFF between transactions; it RECEIVES (interview reads, the
 * mandatory TC-link-key update, remote unlock) only when it POLLS its parent.
 * Without polls z2m adds the device, then the key update + interview time out
 * and it is dropped -- "added but no function". Cadence: FAST (~5/s) while
 * joining and for 60s after the join edge (carries key exchange + interview),
 * then LONG every 2s (remote-unlock latency), none when there is no network.
 * The 2s periodic sleeptimer only WAKES the CPU (flag from ISR context; stack
 * calls are illegal there) -- the poll itself runs in the app tick. */
extern EmberStatus emberPollForData(void);
static volatile uint8_t s_poll_wake;
static sl_sleeptimer_timer_handle_t s_poll_timer;
static void poll_wake_cb(sl_sleeptimer_timer_handle_t *h, void *d) {
    (void)h; (void)d;
    s_poll_wake = 1;              /* wake only: the tick does the polling */
}

/* ---- Radio-deaf self-heal ------------------------------------------------
 * Observed live (2026-07-25..27): after ~35min of SED radio-dozing the RECEIVER
 * dies silently — polls stop being answered, and steering scans complete with
 * ZERO beacons (a live hub 2m away, invisible, 21 scans straight). Nothing
 * re-inits a wedged radio except a reboot, which fixes it instantly (proven:
 * same firmware joined immediately after reset). Until the underlying RAIL/
 * doze cause is fixed, the lock HEALS ITSELF: reboot on clear deaf signatures.
 * NVM3 creds survive reboot -> a joined lock boots straight back JOINED with a
 * fresh radio in ~2s. A lock must NEVER voluntarily leave its network. */
extern void halReboot(void);
extern volatile uint32_t g_dbg_done_count;    /* app.c: steering completions   */
extern volatile uint8_t  g_dbg_done_status;   /* app.c: last steering status   */
extern volatile uint8_t  g_dbg_done_beacons;  /* app.c: beacons heard in steer */

/* ---- board wiring: set from the TYZS3 datasheet (module UART pads) ---- */
#define LOCK_USART        USART0
#define LOCK_USART_CLOCK  cmuClock_USART0
#define LOCK_UART_PORT    gpioPortA          /* TYZS3 pinout CONFIRMED (Nicki_EK serial proto v20260408 p5) */
#define LOCK_TX_PIN       0                  /* module TX = PA0 -> lock MCU RX */
#define LOCK_RX_PIN       1                  /* module RX = PA1 <- lock MCU TX */
#define LOCK_UART_LOC_TX  0                  /* US0_TX LOC0 = PA0 (verified efr32mg13p_af_pins.h) */
#define LOCK_UART_LOC_RX  0                  /* US0_RX LOC0 = PA1 (staggered table; verified) */
#define LOCK_BAUD         115200             /* 115200 8N1 confirmed live on THIS MCU 2026-07-14 (NOT 9600) */

#define KAGEL_ENDPOINT     1
#define KAGEL_CLUSTER_EF00 0xEF00
#define KAGEL_CLUSTER_FC00 0xFC00
static uint8_t     g_eui64[8];
static lock_app_t  g_app;

/* ---- USART RX ring (ISR-filled, drained in kagel_app_tick) ---- */
static volatile uint8_t  rxbuf[256];
static volatile uint16_t rx_head, rx_tail;

/* Debug (SWD): is the module hearing the lock MCU over UART? */
volatile uint32_t g_dbg_uart_rx_bytes;   /* raw bytes received on PA1 from the MCU */
volatile uint8_t  g_dbg_uart_last_byte;

void USART0_RX_IRQHandler(void) {
    while (LOCK_USART->STATUS & USART_STATUS_RXDATAV) {
        uint8_t b = (uint8_t)USART_Rx(LOCK_USART);
        rxbuf[rx_head++ & 0xFF] = b;
        g_dbg_uart_rx_bytes++;
        g_dbg_uart_last_byte = b;
    }
    USART_IntClear(LOCK_USART, USART_IF_RXDATAV);
}

static void uart_init(void) {
    CMU_ClockEnable(cmuClock_GPIO, true);
    CMU_ClockEnable(LOCK_USART_CLOCK, true);
    GPIO_PinModeSet(LOCK_UART_PORT, LOCK_TX_PIN, gpioModePushPull, 1);
    GPIO_PinModeSet(LOCK_UART_PORT, LOCK_RX_PIN, gpioModeInput, 0);

    USART_InitAsync_TypeDef init = USART_INITASYNC_DEFAULT;
    init.baudrate = LOCK_BAUD;
    USART_InitAsync(LOCK_USART, &init);
    LOCK_USART->ROUTELOC0 = (LOCK_UART_LOC_TX << _USART_ROUTELOC0_TXLOC_SHIFT)
                          | (LOCK_UART_LOC_RX << _USART_ROUTELOC0_RXLOC_SHIFT);
    LOCK_USART->ROUTEPEN  = USART_ROUTEPEN_TXPEN | USART_ROUTEPEN_RXPEN;
    USART_IntEnable(LOCK_USART, USART_IF_RXDATAV);
    NVIC_EnableIRQ(USART0_RX_IRQn);
}

/* ============================ lock_app HAL ============================ */

static void hal_uart_write(const uint8_t *buf, size_t n, void *u) {
    (void)u;
    for (size_t i = 0; i < n; i++) USART_Tx(LOCK_USART, buf[i]);
}

/* Time: seeded from the coordinator's genTime, free-runs on sleeptimer. */
static uint32_t g_gmt_base, g_gmt_base_tick;
/* Debug (SWD): what we SERVE the MCU on 0x24, and how often it asks. */
volatile uint32_t g_dbg_gmt_served;
volatile uint32_t g_dbg_gmt_calls;
static uint32_t hal_gmt_now(void *u) {
    (void)u;
    uint32_t secs = (uint32_t)(sl_sleeptimer_get_tick_count64()
                    / sl_sleeptimer_get_timer_frequency());
    uint32_t g = g_gmt_base + (secs - g_gmt_base_tick);
    g_dbg_gmt_served = g;
    g_dbg_gmt_calls++;
    return g;
}
void app_set_gmt(uint32_t gmt) {
    g_gmt_base = gmt;
    g_gmt_base_tick = (uint32_t)(sl_sleeptimer_get_tick_count64()
                     / sl_sleeptimer_get_timer_frequency());
}

/* ---- time sync from the coordinator (Zigbee Time cluster 0x000A) ---------- */
/* The lock MCU timestamps records and validates time-bounded credentials
 * (temp/guest/one-time passwords, remote-unlock windows) against a clock it gets
 * ONLY from our 0x24 replies. Until this landed the module answered 0x24 with 0
 * (1970) -> every time-bounded feature failed. We read genTime from the
 * coordinator after join and feed it to the MCU. */
#define ZCL_TIME_CLUSTER_ID   0x000A
#define ZCL_TIME_ATTR_TIME    0x0000     /* UTCTime, secs since 2000-01-01 */
#define ZIGBEE_TO_UNIX_EPOCH  946684800u /* 2000-01-01 -> 1970-01-01 in secs  */

volatile uint32_t g_dbg_gmt;             /* last unix GMT applied (SWD)        */
volatile uint32_t g_dbg_gentime_resp;    /* # of genTime responses parsed      */
volatile uint32_t g_dbg_gentime_req;     /* # of genTime reads sent            */
volatile uint8_t  g_dbg_force_resync;    /* SWD-write 1 to bounce net-status   */

static void request_gentime(void) {
    uint8_t attrIds[2] = { (uint8_t)ZCL_TIME_ATTR_TIME, (uint8_t)(ZCL_TIME_ATTR_TIME >> 8) };
    emberAfFillCommandGlobalClientToServerReadAttributes(ZCL_TIME_CLUSTER_ID, attrIds, sizeof attrIds);
    emberAfSetCommandEndpoints(KAGEL_ENDPOINT, 1);
    emberAfSendCommandUnicast(EMBER_OUTGOING_DIRECT, EMBER_ZIGBEE_COORDINATOR_ADDRESS);
    g_dbg_gentime_req++;
}

/* Called from app.c's emberAfReadAttributesResponseCallback with the coordinator's
 * Time-cluster reply. Sets the clock and, if it was previously unset, bounces
 * net-status so the MCU re-requests time now rather than on its slow poll. */
void app_on_gentime(uint32_t zigbee_utc) {
    if (zigbee_utc == 0 || zigbee_utc == 0xFFFFFFFFu) return;   /* coordinator clock unset */
    uint32_t unix_gmt = zigbee_utc + ZIGBEE_TO_UNIX_EPOCH;
    int was_unset = (g_gmt_base == 0);
    app_set_gmt(unix_gmt);
    g_dbg_gmt = unix_gmt;
    g_dbg_gentime_resp++;
    if (was_unset) lock_app_resync_time(&g_app);
}

