EDIT-Aeterna/tuya-zigbee-lock-local/firmware/efr32_app.c
/* Send a cluster-specific ZCL command (non-mfg so z2m decodes EF00 unchanged),
 * unicast to the coordinator. */
static void send_cluster(uint16_t cluster, uint8_t cmd, const uint8_t *pl, uint16_t n) {
    /* SERVER_TO_CLIENT: real Nicki_EK devices report DPs device->coordinator; z2m only
     * decodes the vendor DP cluster's reports (dataResponse 0x01) in this direction.
     * client->server made z2m tag them type 'raw' and skip its datapoint converters. */
    uint8_t fc = (ZCL_CLUSTER_SPECIFIC_COMMAND | ZCL_FRAME_CONTROL_SERVER_TO_CLIENT);
    emberAfFillExternalBuffer(fc, cluster, cmd, "b", pl, n);
    emberAfSetCommandEndpoints(KAGEL_ENDPOINT, 1);
    emberAfSendCommandUnicast(EMBER_OUTGOING_DIRECT, EMBER_ZIGBEE_COORDINATOR_ADDRESS);
}

/* Zigbee EF00: Nicki_EK datapoint frame: status(1)=0, transid(1), dp(1), type(1), len(2 BE), value. */
static uint8_t g_transid;
/* Debug (SWD): DPs the MCU reported and we forwarded to the hub over EF00. */
volatile uint32_t g_dbg_dp_count;
volatile uint8_t  g_dbg_last_dp_id;
volatile uint8_t  g_dbg_last_dp_type;
volatile uint32_t g_dbg_last_dp_val;   /* first up-to-4 value bytes, big-endian */

/* Debug (SWD): the timestamp the MCU stamped its last RECORD (0x23) with = the
 * MCU's OWN clock. ~1.78e9 => real 2026 time (sync worked); ~0/tiny => still 1970. */
volatile uint32_t g_dbg_last_mcu_ts;
static void hal_zb_ef00_report(uint8_t dp_id, uint8_t type, const uint8_t *val,
                               uint16_t len, uint32_t ts, void *u) {
    (void)u;
    if (ts) g_dbg_last_mcu_ts = ts;
    g_dbg_dp_count++;
    g_dbg_last_dp_id = dp_id;
    g_dbg_last_dp_type = type;
    { uint32_t v = 0; for (uint16_t i = 0; i < len && i < 4; i++) v = (v << 8) | val[i];
      g_dbg_last_dp_val = v; }
    uint8_t p[6 + 256];
    if (len > 256) return;
    p[0] = 0x00; p[1] = g_transid++; p[2] = dp_id; p[3] = type;
    p[4] = (uint8_t)(len >> 8); p[5] = (uint8_t)len;
    if (len) memcpy(&p[6], val, len);
    send_cluster(KAGEL_CLUSTER_EF00, 0x01 /* dataReport */, p, (uint16_t)(6 + len));
}

/* Debug (SWD): ground-truth capture of the serial commands the lock MCU issues.
 * ring = last 16 cmd bytes (idx & 15 = newest slot just written); per-command
 * counters for the ones that matter for the password investigation. Read after a
 * keypad/temp/dynamic-password attempt to see EXACTLY what the MCU sent. */
volatile uint8_t  g_dbg_cmd_ring[16];
volatile uint32_t g_dbg_cmd_idx;
volatile uint32_t g_dbg_cmd07;      /* 0x07 dynamic-password verify requests   */
volatile uint32_t g_dbg_cmd08;      /* 0x08 offline-password verify requests    */
volatile uint32_t g_dbg_cmd05;      /* 0x05 DP report (status push)             */
volatile uint32_t g_dbg_cmd23;      /* 0x23 record report (unlock events)       */
volatile uint8_t  g_dbg_last_cmd;
static void hal_on_frame(uint8_t cmd, const uint8_t *data, uint16_t dlen, void *u) {
    (void)data; (void)dlen; (void)u;
    g_dbg_cmd_ring[g_dbg_cmd_idx & 15] = cmd;
    g_dbg_cmd_idx++;
    g_dbg_last_cmd = cmd;
    if (cmd == 0x07) g_dbg_cmd07++;
    else if (cmd == 0x08) g_dbg_cmd08++;
    else if (cmd == 0x05) g_dbg_cmd05++;
    else if (cmd == 0x23) g_dbg_cmd23++;
}

/* User put the lock in pairing / factory-reset (MCU 0x03). Leave the Zigbee
 * network so the stack-status callback re-steers into the open permit window --
 * a module holding stale NVM3 creds otherwise stays "joined" and never re-pairs
 * (the add-device timeout). Done via a flag: emberLeaveNetwork() must run in the
 * main-loop tick, not this serial-callback context. */
volatile uint32_t g_dbg_config_reqs;
volatile uint32_t g_dbg_pair_leaves;      /* # of user-pair leaves honored (SWD) */
volatile uint32_t g_dbg_pair_press;       /* # of pair-ceremony frames (sub 0x01/0x02) */
volatile uint8_t  g_pairing;              /* forces OFFLINE to the MCU during a re-pair */
volatile uint8_t  g_pair_left;            /* the pairing leave has actually happened */
static volatile uint8_t g_do_leave_pair;  /* set by 0x03 sub=0x01, acted in tick */
static uint32_t         g_last_pair_leave;
extern volatile uint8_t g_link_ok;        /* confirmed contact this session (app.c) */

/* ---- network-configuration (pairing) window -----------------------------------
 * Nicki_EK protocol §6.4 defines exactly THREE configure commands: 0x00 factory-reset
 * the module, 0x01 START NETWORK CONFIGURATION, 0x02 "MCU has restored factory
 * settings". There is NO "exit pairing" command -- the MCU never tells us the user
 * left the menu. The module is therefore REQUIRED to time its own pairing window
 * out, exactly like a stock Nicki_EK module (~3 min).
 *
 * We previously had NO timeout: join_wake_cb re-armed a steer every 6s forever
 * whenever unjoined. Network steering is not "rejoin my hub" -- it joins ANY
 * coordinator that permits joining, with the default TC link key. So a lock that
 * failed to pair sat hunting indefinitely and would silently join whoever opened
 * their permit window next (observed: 152 steers over 14 min, then it joined with
 * no press at all). On a door lock that is a security bug, not just untidiness.
 *
 * Two distinct situations, previously conflated into "just steer":
 *   PAIR   (user pressed / factory-fresh boot) -> steer, but only inside the window.
 *   OFFLINE(joined once, lost the parent)      -> REJOIN our own network with our
 *                                                 existing key. Never steer: losing
 *                                                 your parent is not consent to join
 *                                                 a stranger.
 * Window expiry while unjoined is a real failure: we keep reporting net-status 0x00
 * ("not connected to a gateway", §6.3) and the MCU shows "pairing failed" -- which
 * is the truthful outcome the doc describes, not something to paper over. */
/* Nicki_EK's documented default is 180s (range 30-600). We use 120s because THIS lock's
 * MCU gives up at 120s (measured by Nicki 2026-07-16, and matching the observed "lock
 * said timed out" while our radio was still scanning). Nicki_EK's 180 presumably matches
 * THEIR MCU; ours is shorter. Module and lock must stop together: a window that
 * outlives the MCU's leaves the radio offering itself for 60s AFTER the user has been
 * told pairing failed -- the same "pairing mode outliving user intent" defect, just
 * smaller. If a future lock MCU uses a different timeout, match it here. */
#define KAGEL_PAIR_WINDOW_S   120u
volatile uint32_t g_pair_window_end;      /* 0 = closed; else uptime secs deadline */
volatile uint32_t g_dbg_rejoins;          /* # of secure rejoin attempts (SWD) */

static uint32_t now_s(void) {
    return (uint32_t)(sl_sleeptimer_get_tick_count64()
                      / sl_sleeptimer_get_timer_frequency());
}
static void pair_window_open(void)  { g_pair_window_end = now_s() + KAGEL_PAIR_WINDOW_S; }
static int  pair_window_open_now(void) {
    return g_pair_window_end && now_s() < g_pair_window_end;
}
/* exposed to app.c's stack-status / steering-complete callbacks */
int kagel_pair_window_open(void) { return pair_window_open_now(); }

/* Called the moment we are actually on a network. Closing pairing is the JOIN's
 * job, not the timer's -- a joined slave must leave network-configuration mode at
 * once. Also hard-stops the steering plugin so no scan can be left in flight. */
volatile uint32_t g_dbg_pair_closes;
extern volatile uint8_t g_retry_join;      /* defined below */
void kagel_pair_window_close(void) {
    if (g_pair_window_end) g_dbg_pair_closes++;
    g_pair_window_end = 0;
    g_retry_join = 0;
    emberAfPluginNetworkSteeringStop();
}
static void hal_on_config(uint8_t sub, void *u) {
    (void)u;
    g_dbg_config_reqs++;
    /* GROUND TRUTH (dual-line capture 2026-07-16). A press is a two-frame ceremony,
     * MCU->module:  sub=0x02 (reset notify)  THEN  sub=0x01 (start pairing).
     * 0x03 appears ONLY at a press -- never spuriously, never at rest.
     * sub=0x00 is NOT a press: it is OUR OWN ack (nicki_ek_lock_serial.c sends cmd 0x03
     * payload ok=0x00 module->MCU). The old "sub=0x00 = press" note read that ack off
     * the wrong line, so this hook never fired at all.
     *
     * REPORT vs LEAVE are deliberately separated -- conflating them caused BOTH of the
     * symptoms seen on 2026-07-16:
     *  - REPORT offline on the WHOLE ceremony (0x02 and 0x01). 0x02 lands FIRST, and
     *    answering it with the stale online is the instant false "pairing successful";
     *    keying on 0x01 alone was one frame too late.
     *  - LEAVE only on 0x01, so a reset-notify alone can't drop a healthy network
     *    (the 3a8bbe8 self-pairing regression came from leaving on every 0x03).
     * The debounce must NOT gate g_pairing: a user pressing pair twice in quick
     * succession previously got no OFFLINE at all, so the MCU timed out -> "pairing
     * failed" while the module rejoined behind its back. It is now 3s -- just enough
     * to coalesce duplicate 0x01s inside ONE ceremony, never long enough to swallow a
     * second deliberate press (a 20s debounce did exactly that). EVERY genuine press
     * must leave: skipping the leave while still joined let the tick clear g_pairing
     * on the next pass -> instant ONLINE -> the false ack all over again.
     * Boot-settle (>10s) keeps a power-on config from self-pairing. */
    if (sub != 0x01 && sub != 0x02) return;
    g_dbg_pair_press++;
    uint32_t now = now_s();
    if (now < 10) return;                                   /* ignore boot-time config */
    if (sub == 0x01) pair_window_open();  /* §6.4: 0x01 = start network configuration */
    g_pairing = 1;                       /* every ceremony frame -> answer OFFLINE */
    /* Contact is no longer "confirmed" for THIS ceremony: drop g_link_ok so the tick's
     * clear-condition cannot fire before we have actually left and rejoined. Without
     * this, emberLeaveNetwork() being async means netstate still reads JOINED on the
     * same tick and the latch is wiped a millisecond after we set it. */
    g_link_ok = 0;
    g_pair_left = 0;
    if (sub != 0x01) return;             /* reset-notify: report only, never leave */
    if (g_last_pair_leave && (now - g_last_pair_leave) < 3) return;  /* coalesce dupes */
    g_last_pair_leave = now;
    g_do_leave_pair = 1;
}

/* "online" to the lock MCU = JOINED to a coordinator AND confirmed live contact
 * with it this session (g_link_ok, set in app.c). netstate==JOINED alone can be
 * STALE (creds left in NVM after the coordinator removed us) — reporting online on
 * that gave a false "pairing successful". Requiring g_link_ok kills the false
 * success; the orphan-detector below then re-steers a stale binding. */
extern volatile uint8_t g_link_ok;
extern volatile uint32_t g_tx_fail;   /* consecutive failed sends (app.c) */
/* Our device joins as a ROUTER but, once associated, emberAfNetworkState()
 * persistently reports EMBER_JOINED_NETWORK_S2S_TARGET (5) rather than plain
 * EMBER_JOINED_NETWORK (2) on this SDK. A literal `== EMBER_JOINED_NETWORK`
 * check is therefore FALSE for a live, fully-joined lock — which silently
 * disabled the announce AND the 15s gentime keepalive, so the now-quiet lock
 * stopped touching the coordinator and z2m marked it offline. Treat every
 * "joined" variant as joined. (NO_PARENT (3) is excluded — the rejoin logic
 * above owns that case.) */
static int net_is_joined(void) {
    EmberNetworkStatus s = emberAfNetworkState();
    return s == EMBER_JOINED_NETWORK
        || s == EMBER_JOINED_NETWORK_S2S_INITIATOR
        || s == EMBER_JOINED_NETWORK_S2S_TARGET;
}
static int hal_is_joined(void *u) {
    (void)u;
    /* Online if JOINED and we've had REAL contact this session (g_link_ok). We do
     * NOT gate on g_tx_fail here — a marginal-but-genuine link has occasional send
     * failures and must not flap offline. The false-success we care about is the
     * boot-with-stale-creds case, which g_link_ok already blocks; a force-removed
     * live lock is handled by the conservative leave below (many fails in a row). */
    return net_is_joined() && g_link_ok && !g_pairing;
}

/* Called from app.c's emberAfPreCommandReceivedCallback for cluster 0xFC00 --
 * the vendor control channel (REMOTE_DP / CREATE_TEMP_PW). The claim/auth
 * messages (1..6) and their chunked-reassembly + ed25519 watchdog yield were
 * removed with the anti-clone machinery (2026-07-17). NOTE the shipping control
 * path is EF00 DP writes, not this — see app_zb_ef00_rx below. */
volatile uint32_t g_dbg_fc00_rx;
void app_zb_fc00_rx(uint8_t cmd, const uint8_t *payload, uint16_t len) {
    g_dbg_fc00_rx++;
    lock_app_zb_rx(&g_app, (lock_msg_t)cmd, payload, len);
}

/* Called from app.c for cluster 0xEF00 (hub remote-DP control via z2m). */
volatile uint32_t g_dbg_ef00_rx;   /* debug (SWD): incoming remote-DP commands */
void app_zb_ef00_rx(uint8_t cmd, const uint8_t *payload, uint16_t len) {
    g_dbg_ef00_rx++;
    lock_app_ef00_rx(&g_app, cmd, payload, len);
}

/* ============================ lifecycle ============================ */

