EDIT-Aeterna/tuya-zigbee-lock-local/firmware/efr32_app.c
static const lock_app_hal_t APP_HAL = {
    .zb_ef00_report = hal_zb_ef00_report,
    .uart_write     = hal_uart_write,
    .gmt_now        = hal_gmt_now,
    .on_frame       = hal_on_frame,
    .on_config      = hal_on_config,
    .is_joined      = hal_is_joined,
    .user           = NULL,
};

/* Join retry is driven by the steering-COMPLETE callback (app.c): on a failed
 * steer it sets g_retry_join and kagel_app_tick starts a fresh steer. Retrying
 * only AFTER a full steer completes means we never interrupt an in-progress
 * join. (The earlier periodic 15s Stop+Start aborted joins mid-flight -> flaky.) */
volatile uint8_t g_retry_join;

/* Status of the forced Basic-identity writes (read over SWD). 0x00 = SUCCESS;
 * 0x86 = UNSUPPORTED_ATTRIBUTE (attr not declared in ZAP on this endpoint). */
volatile uint8_t g_dbg_mfg_wr   = 0xEE;
volatile uint8_t g_dbg_model_wr = 0xEE;
volatile uint8_t g_dbg_pwr_wr   = 0xEE;   /* Basic powerSource write status (0x00=OK) */

/* Periodic wake so join RETRIES actually run. While unjoined (NO_NETWORK) there is
 * no radio traffic to wake the power-managed super-loop, so the retry poll in
 * kagel_app_tick never fires -- the module tries to join ONCE at boot and, if it
 * misses the permit window, sleeps forever (the add-device timeout). This timer's
 * interrupt wakes the loop every few seconds and re-arms the retry until we join.
 * It only sets the flag when unjoined; the tick's NO_NETWORK + 5s-spacing guards
 * keep it from disturbing an in-progress or established join. */
static int net_is_joined(void);   /* joined incl. the S2S_TARGET variant (see below) */
static sl_sleeptimer_timer_handle_t s_join_wake_timer;
static void join_wake_cb(sl_sleeptimer_timer_handle_t *h, void *d) {
    (void)h; (void)d;
    /* Only re-arm a STEER while the pairing window is genuinely open. Outside it we
     * stay dormant: an unpaired lock must not keep offering itself to any coordinator
     * that opens a permit window (it used to do exactly that, forever). The lost-parent
     * case is handled by the rejoin path in the tick, not here. */
    if (!net_is_joined() && pair_window_open_now())
        g_retry_join = 1;
}

void kagel_app_init(void) {
    /* Keep the CPU out of EM2 so the super-loop keeps running. */
    sl_power_manager_add_em_requirement(SL_POWER_MANAGER_EM1);

    emberAfGetEui64(g_eui64);
    uart_init();
    lock_app_init(&g_app, &APP_HAL);
    lock_app_start(&g_app);          /* product-info query; gate stays CLOSED */

    /* Force-serve the Basic identity so z2m's interview always reads it (the ZAP
     * RAM defaults read back empty). ZCL char strings are length-prefixed;
     * cluster 0x0000 Basic, attr 0x0004 mfrName / 0x0005 modelId, type 0x42 string. */
    static const uint8_t s_mfg[]   = {13,'S','m','a','r','t','H','o','m','e','P','l','u','s'};
    static const uint8_t s_model[] = {9,'L','C','K','-','B','I','4','0','0'};
    g_dbg_mfg_wr   = (uint8_t)emberAfWriteServerAttribute(KAGEL_ENDPOINT, 0x0000, 0x0004, (uint8_t *)s_mfg,   0x42);
    g_dbg_model_wr = (uint8_t)emberAfWriteServerAttribute(KAGEL_ENDPOINT, 0x0000, 0x0005, (uint8_t *)s_model, 0x42);
    /* Basic attr 0x0007 powerSource = BATTERY (0x03, enum8). ZAP default is 0x00
     * (Unknown) -> z2m never learned this is battery-powered, so its availability
     * logic pinged it like a mains device. Now a sleepy device is correctly a
     * battery device to the coordinator. (Cosmetic/availability only; unrelated to
     * the deaf-radio wedge and to remote-unlock delivery.) */
    static const uint8_t s_pwr = EMBER_ZCL_POWER_SOURCE_BATTERY;
    g_dbg_pwr_wr = (uint8_t)emberAfWriteServerAttribute(KAGEL_ENDPOINT, 0x0000, 0x0007, (uint8_t *)&s_pwr, ZCL_ENUM8_ATTRIBUTE_TYPE);

    /* BOOT NEVER OPENS A PAIRING WINDOW. Only a deliberate user press (MCU 0x03
     * sub=0x01) does -- see hal_on_config.
     *
     * This used to open one 120s window when it came up with no NVM3 creds, copying a
     * stock module's "factory-fresh pairs on first power-up". On a DOOR LOCK that is
     * the wrong default: it means a power event that finds the module credential-less
     * puts it in pairing mode with nobody touching it, silently offering itself to any
     * coordinator with an open permit window. Nicki hit exactly that on a hard power
     * reset after a flash (2026-07-17) -- the erase wipes the creds, so every reboot
     * until it joins was a fresh unattended pairing window.
     *
     * A credential-less module now sits INERT until someone physically presses pair.
     * Cost: after a factory flash the installer must press pair once. That is the
     * correct trade for a lock -- pairing should require human intent, always.
     * (A module that still HOLDS creds never steered at boot anyway; it rejoins its
     * own network -- verified by the power-cycle test, 2026-07-17.) */

    /* Wake the loop every 6s so join retries fire even with no radio traffic to
     * wake it (the fix for the "joins once at boot then stalls" add-device timeout). */
    sl_sleeptimer_start_periodic_timer_ms(&s_join_wake_timer, 6000,
                                           join_wake_cb, NULL, 0, 0);

    /* Wake the loop every 2s for the SED long poll (see poll block in the tick). */
    sl_sleeptimer_start_periodic_timer_ms(&s_poll_timer, 2000,
                                           poll_wake_cb, NULL, 0, 0);
}

/* --- debug telemetry, read over SWD (resolve addresses from the .axf) --- */
volatile uint32_t g_dbg_ticks;        /* increments every tick (is the loop live?) */
volatile uint32_t g_dbg_steer_calls;  /* how many times we called steering */
volatile int32_t  g_dbg_steer_rc = -999;  /* last steering start rc (0=OK) */
volatile int32_t  g_dbg_steer_first_rc = -999; /* FIRST steering start rc (0=started) */
volatile uint8_t  g_dbg_netstate = 0xEE;  /* last emberAfNetworkState() */

/* Debug (SWD): anti-clone gate state. bound=persisted claim; online=bound+authed
 * this session (gate OPEN -> MCU told 0x03). Proves a claim opened the gate. */
volatile uint8_t g_dbg_bound;
volatile uint8_t g_dbg_online;
volatile uint32_t g_dbg_announce_calls;  /* # of net-status "online" pushes to the MCU */

