EDIT-Aeterna/tuya-zigbee-lock-local/firmware/efr32_app.c
void kagel_app_tick(void) {
    g_dbg_ticks++;
    g_dbg_netstate = (uint8_t)emberAfNetworkState();
    g_dbg_online = (uint8_t)lock_app_is_online(&g_app);
    tls_pending_tick(&g_app.tls);   /* retry wakeup-verified command sends */

    /* ── SED polling (rationale at poll_wake_cb above). State-gated: poll ONLY while
     * JOINING (1) or JOINED (2) — polling with no parent hangs the MAC. FAST ~200ms
     * while joining + 60s post-join (TC-key update + z2m interview), LONG 2s after
     * (each s_poll_wake from the periodic timer), none unjoined. ── */
    {
        EmberNetworkStatus st = emberAfNetworkState();
        if (st == EMBER_JOINING_NETWORK || st == EMBER_JOINED_NETWORK) {
            static uint32_t s_joined_edge;             /* uptime secs of the join edge */
            if (st == EMBER_JOINED_NETWORK) { if (!s_joined_edge) s_joined_edge = now_s(); }
            else s_joined_edge = 0;
            int fast = (st == EMBER_JOINING_NETWORK)
                    || (s_joined_edge && (now_s() - s_joined_edge) < 60);
            if (fast) {
                static uint32_t s_next_fast;           /* sleeptimer ticks */
                uint32_t nt = sl_sleeptimer_get_tick_count();
                if ((int32_t)(nt - s_next_fast) >= 0) {
                    s_next_fast = nt + sl_sleeptimer_ms_to_tick(200);
                    emberPollForData();
                }
            } else if (s_poll_wake) {
                s_poll_wake = 0;
                emberPollForData();
            }
        } else {
            s_poll_wake = 0;
        }
    }

    /* User pressed pair (MCU 0x03 sub=0x01): leave the network so we re-steer and
     * rejoin fresh — a device told to pair always re-pairs, whatever its state. */
    if (g_do_leave_pair) {
        g_do_leave_pair = 0;
        g_dbg_pair_leaves++;
        emberLeaveNetwork();
        g_pair_left = 1;                 /* the leave is now in flight -> latch may clear */
        g_retry_join = 1;
    }
    /* Re-pair done: clear the latch ONLY after the leave actually happened AND we have
     * genuinely rejoined (fresh contact -> g_link_ok). Checking JOINED+g_link_ok alone
     * cleared it instantly — emberLeaveNetwork() is async, so netstate still reads
     * JOINED on this same tick, and on a debounced press we never left at all. Either
     * way the module snapped back to ONLINE and the MCU declared a false success. */
    if (g_pairing && g_pair_left
        && net_is_joined() && g_link_ok) {
        g_pairing = 0;
        g_pair_left = 0;
    }

    /* Retry flagged (boot, or a prior steer completed without joining): start a
     * fresh scan, but SPACED >=5s apart so the radio settles between scans
     * (rapid back-to-back steers produced NO_BEACONS). Never runs mid-join
     * because the flag is only set after a full steer completes. */
    if (g_retry_join) {
        uint32_t now = now_s();
        static uint32_t s_next_steer_ok;
        /* Steering is PAIRING -- it joins whoever permits, with the default TC key.
         * Gate it on the window so an unpaired lock goes dormant instead of hunting
         * forever (see the pairing-window note above). */
        if (!pair_window_open_now()) {
            g_retry_join = 0;
        } else if (now >= s_next_steer_ok && emberAfNetworkState() == EMBER_NO_NETWORK) {
            g_retry_join = 0;
            s_next_steer_ok = now + 5;
            emberAfPluginNetworkSteeringStop();
            g_dbg_steer_rc = (int32_t)emberAfPluginNetworkSteeringStart();
            if (g_dbg_steer_calls == 0) g_dbg_steer_first_rc = g_dbg_steer_rc;
            g_dbg_steer_calls++;
        }
    }

    /* Lost our parent but we still hold network creds: REJOIN our own network with
     * our existing key. This is the "offline" case from §6.3, NOT pairing -- it must
     * never fall through to steering, or a lock that merely lost its hub would offer
     * itself to any coordinator with an open permit window. Spaced 10s; the stack
     * reports the outcome via the usual stack-status path. */
    {
        static uint32_t s_np_since;   /* deaf-radio self-heal clock (see halReboot note) */
        if (emberAfNetworkState() == EMBER_JOINED_NETWORK_NO_PARENT) {
            static uint32_t s_next_rejoin_ok;
            uint32_t now = now_s();
            if (!s_np_since) s_np_since = now;
            /* Rejoin needs a WORKING receiver. Parent unreachable 60s straight with
             * rejoins running = wedged-deaf RX -> reboot heals it (creds survive). */
            if (now - s_np_since >= 60) halReboot();
            if (now >= s_next_rejoin_ok) {
                s_next_rejoin_ok = now + 10;
                g_dbg_rejoins++;
                emberFindAndRejoinNetwork(true, 0);   /* true = keep current network key */
            }
        } else {
            s_np_since = 0;
        }
    }

    /* Deaf-scan self-heal: 3 consecutive steers hearing ZERO beacons = deaf RX.
     * Reboot re-inits the radio so the user's NEXT pair press actually works
     * (instead of needing a debugger reset, as on 2026-07-27). */
    {
        static uint32_t s_done_seen; static uint8_t s_deaf;
        if (g_dbg_done_count != s_done_seen) {
            s_done_seen = g_dbg_done_count;
            if (g_dbg_done_status != 0 && g_dbg_done_beacons == 0) {
                if (++s_deaf >= 3) halReboot();
            } else s_deaf = 0;
        }
    }

    /* Once joined, proactively announce net-status "online" to the lock MCU so it
     * begins streaming DP reports. The MCU waits for the module to push this (real
     * Nicki_EK modules do it unprompted); without it the MCU stays provisioned-but-
     * offline and never reports unlock events even though the gate is open.
     * Re-asserted every ~3s: covers the MCU booting after the module, and serves
     * as the connection keep-alive. Gated inside lock_app on the anti-clone gate,
     * so a claim-gated build stays silent until a valid claim opens it. */
    /* SWD bench hook: write g_dbg_force_resync=1 (after SWD-setting g_gmt_base)
     * to bounce net-status and make the MCU re-request time immediately. */
    if (g_dbg_force_resync) { g_dbg_force_resync = 0; lock_app_resync_time(&g_app); }

    static uint8_t s_announced;   /* one-shot: announce online on the join EDGE only */
    if (!net_is_joined()) s_announced = 0;
    if (net_is_joined()) {
        uint32_t now = (uint32_t)(sl_sleeptimer_get_tick_count64()
                       / sl_sleeptimer_get_timer_frequency());
        /* Announce "online" ONCE per join. Do NOT re-push on a timer: a real module
         * reports net-status on CHANGE and answers the MCU's own net-status query
         * (handled in the serial core), it does not heartbeat "still online" every
         * few seconds. The old 3s re-announce woke the battery MCU constantly AND
         * made it re-request time on each push -> the UART flood Nicki saw. One-shot
         * on the join edge is what the MCU actually needs. */
        if (!s_announced) {
            s_announced = 1;
            lock_app_announce_online(&g_app);
            g_dbg_announce_calls++;
        }

        /* Read genTime from the coordinator until we have a clock, then refresh
         * daily for drift. Cheap unicast read; app_on_gentime applies the reply. */
        static uint32_t s_next_gentime;
        if (now >= s_next_gentime) {
            s_next_gentime = now + 15;   /* clock refresh + reachability probe: a stale
                                          * binding's read fails -> g_tx_fail climbs */
            request_gentime();
        }

        /* Send-failure self-heal — REBOOT, never leave. 30 consecutive failed sends
         * with zero successes = dead RX (radio wedge) or a truly-gone binding; either
         * way a reboot is the safe move: creds survive, we rejoin our OWN network with
         * a fresh radio. The old emberLeaveNetwork() here turned a radio glitch into a
         * PERMANENTLY dormant lock (left = creds wiped + window shut = offline until a
         * physical press that also needs open permit-join; cost 2 dead days, 07-25..27). */
        if (g_tx_fail >= 30) halReboot();


    }

    while (rx_tail != rx_head) {
        uint8_t b = rxbuf[rx_tail++ & 0xFF];
        lock_app_uart_rx(&g_app, &b, 1);
    }
}
